{
  "abaName": "Ericton QA Test Analyst",
  "home": "Home",
  "about": "About",
  "resume": "Resume",
  "portfolio": "Portfolio",
  "hello": "Hello, I am",
  "name": "Ericton Brito",
  "profession": "QA Test Analyst",
  "description": "QA Test Analyst specialized in test automation with a focus on APIs and E2E testing.",
  "download_cv": "Download CV",
  "job_title": "QA Test Analyst!",
  "experience_desc": "I have experience in software quality assurance, focusing on automated API testing using Cypress, Robot Framework, and K6. I also implement complete E2E testing flows with Cypress and Playwright, ensuring performance and integrated functionality. I am proactive, organized, and a problem solver, applying agile methodologies to plan and collaborate with the development team.",
  "experience": "Experience",
  "skill": "Skill",
  "education": "Education",
  "intern": "Intern",
  "programmer": "Programmer",
  "job_desc_QA": "QA Test Analyst: My experience includes automated API testing with Cypress, Robot, K6, JMeter, Insomnia, and Swagger for API documentation. I have performed automated frontend tests using Cypress and Playwright, as well as manual testing for mobile applications. I manage defects using QASE, Trello, and GitLab, applying agile methodologies (Scrum and Kanban) to optimize processes.",
  "job_desc_intern_dev": "Frontend Web Development: Creation of responsive interfaces using HTML5, CSS3, JavaScript, TypeScript, and Angular 10, on Linux. Execution of unit tests during application development.",
  "job_desc_intern_dev_test": "Frontend Web Development: Creation of responsive interfaces using HTML5, CSS3, JavaScript, TypeScript, and Angular 6, on Linux. Execution of unit tests during application development. Software Testing: Execution of manual tests and detailed documentation of non-conformities. Collaboration with development teams to define test scenarios.",
  "job_desc_intern_programmer": "Frontend Development: Support in developing frontend interfaces using Bootstrap. Creation of responsive layouts and performance optimization in web applications.",
  "title_pos_gradu": "Postgraduate",
  "title_gradu": "Graduation",
  "title_course": "Course",
  "company": "ICTS Group",
  "status_progress": "2024 - Progress",
  "status_progress_2": "2025 - Progress",
  "course_completed": "2025 - Completed",
  "course_completed_4": "2024 - Completed",
  "course_completed_3": "2023 - Completed",
  "course_completed_2": "2022 - Completed",
  "completed": "2018 - 2021 - Completed",
  "course_pos": "MBA in Software Quality Management",
  "course_grad": "Information Systems",
  "faveni": "Venda Nova do Imigrante College - FAVENI",
  "uninorte": "Northern University Center - UNINORTE",
  "title_desc_couse": "Dual Experience with Cypress and CodeceptJS",
  "title_desc_course_2": "Continuous Testing with Cypress in GitHub Actions",
  "title_desc_course_3": "Testing REST APIs with Rest-Assured",
  "title_desc_course_5": "Testing REST API with MongoDB and RabbitMQ in Cypress",
  "title_desc_course_6": "Software Testing",
  "title_desc_course_7": "JavaScript for QA",
  "title_work":  "My Work",
  "title_service": "My Service",
  "test_api": "API testing with Cypress",
  "my_portfolio": "My Portfolio",
  "desc_work": "Continuous testing workflow for Cypress API in GitHub Actions",
  "desc_work_2": "My portfolio is an interactive application developed with HTML5, CSS3, and JavaScript, designed to creatively and functionally showcase my skills, projects, and professional experience.",
  "title_frontend": "FULL Frontend Developer",
  "title_automated_api": "Automated API Testing",
  "title_e2e": "Automated E2E Testing",
  "desc_frontend": "I have experience in developing websites and web applications using Angular, JavaScript, TypeScript, and SCSS, ensuring modern and responsive interfaces.",
  "desc_automated_api": "I have experience in manual and automated testing, covering usability, performance, stress, functional, and non-functional tests. I use tools such as Cypress, Robot Framework, Rest-Assured, Insomnia, Postman, and K6, in addition to creating and documenting test plans.",
  "desc_e2e": "I perform manual and automated end-to-end testing, covering usability, performance, stress, functional, non-functional, and exploratory tests. I work with tools such as Cypress, Playwright, and Robot Framework to ensure total product quality.",
  "cypress_cucumber": "Cypress with Cucumber and GitHub Actions",
  "desc_work_3": "Test Automation with Cypress, Cucumber, and Integration Testing using GitHub Actions.",
  "title_desc_course_8": "End-To-End Testing with Cypress",
  "title_desc_course_9": "Web Automation - Cypress and Cucumber",
  "title_desc_course_10": "Testing Modern Applications with Cypress"
}
